Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: Both C<BEGIN> and C<CHECK> blocks are run when you use the B<-c> switch for a compile-only syntax check, although your main code is not.
es: Los bloques C<BEGIN> y C<CHECK> se ejecutan cuando se usa el modificador B<-c> para llevar a cabo únicamente una compilación de comprobación de la sintaxis, aunque no se ejecute el código principal.

source: Both failures are not really specific to the Hurd, as indicated by the test suite output.
es: En realidad, estos errores no son específicos de Hurd (como parece indicar el resultado del conjunto de pruebas).

source: Both forms are equivalent.
es: Ambas formas son equivalentes.

source: Both machines also have a full CPAN mirror in /srv/CPAN, please use this.
es: Ambos equipos también tienen un servidor reflejado de CPAN completo en /srv/CPAN. Use estos servidores.

source: Both of these things have on/off switches.
es: Ambos aparatos tienen interruptores de encendido/apagado.

source: Braces are required in referring to named capture groups, but are optional for absolute or relative numbered ones.
es: Para hacer referencia a grupos de captura con nombre deben usarse llaves obligatoriamente, pero si se usan números absolutos o relativos, las llaves son opcionales.

source: Braces are safer when creating a regex by concatenating smaller strings.
es: Las llaves son más seguras cuando se crea una expresión regular mediante la concatenación de cadenas más pequeñas.

source: Briefly, C</l> sets the character set to that of whatever B<L>ocale is in effect at the time of the execution of the pattern match.
es: De forma resumida, C</l> establece como juego de caracteres el indicado por la configuración regionaB<l> que esté activa en el momento de buscar coincidencias del patrón.

source: Building tree structures from Perl variables and then traversing them is a nice, general problem, and if nobody's already written a module that does that, you might want to modularise that code too.
es: Crear estructuras de árbol a partir de variables Perl y después recorrerlas es un problema de aplicación general interesante, y si nadie ha creado un módulo que haga eso, es posible que desee convertir también este código en un módulo.

source: But anything more complicated in the subscript will be interpreted as an expression.
es: Pero cualquier otra cosa más complicada en el subíndice se interpretará como una expresión.

source: But a minus sign is not legal with it.
es: Pero no se puede usar un signo menos.

source: But as those 2 functions are part of the 1989 ANSI C spec we suspect you'll find them everywhere by now.
es: Pero como estas dos funciones forman parte de la especificación de ANSI C del año 1989, sospechamos que actualmente estarán disponibles en todas partes.

source: But because a quantifier (C<\D*>) has been used in the regular expression, the search engine can backtrack and retry the match differently in the hope of matching the complete regular expression.
es: Pero como se ha utilizado un cuantificador (C<\D*>) en la expresión regular, el motor de búsqueda puede dar marcha atrás y volver a intentar la coincidencia de manera diferente con la esperanza de encontrar una coincidencia de la expresión regular completa.

source: But don't be lazy, and don't use the fact that Perl's internal format is UTF-8 to your advantage.
es: Pero no sea perezoso; no debe basarse en el hecho de que el formato interno de Perl es UTF-8.

source: But if we used that package name directly as a filename it would make for unwieldy or impossible filenames on some systems.
es: Pero si se usa ese nombre de paquete directamente como nombre de archivo, la manipulación de este nombre de archivo podría resultar difícil (o incluso imposible) en otros sistemas.

source: But if you ask this question of someone who isn't a computer scientist, they might tell you that a I<program> has been compiled to physical machine code once and can then be run multiple times, whereas a I<script> must be translated by a program each time it's used.
es: Pero si hace esta pregunta a alguien que no es un científico de computación, pueden decirle que un I<programa> se compila para generar código máquina físico que se puede ejecutar repetidamente, mientras que un I<script> debe ser traducido por un programa cada vez que se ejecuta.

source: But if you never use C<$&>, C<$`> or C<$'>, then patterns I<without> capturing parentheses will not be penalized.
es: Pero si nunca se usa C<$&>, C<$`> o C<$'>, no se penalizarán los patrones I<sin> paréntesis de captura.

source: But in all other cases, you should decode it.
es: Pero en todos los demás casos debe hacerlo.

source: But in another sense, all package symbols are also globals--they're just well-organized globals.
es: Pero en otro sentido, todos los símbolos de paquete son variables globales, solo que bien organizadas.

source: But instead of some high-tech exclusion software, they used a low-tech method to prevent multiple simultaneous backups: a stuffed pumpkin.
es: Pero en lugar de usar un software de exclusión de alta tecnología, usaban un método de "baja tecnología" para evitar que se realizaran varias copias de seguridad a la vez: una calabaza de peluche.

source: But it leads to some ambiguities if there are more than 9 capture groups, as C could mean either the tenth capture group, or the character whose ordinal in octal is 010 (a backspace in ASCII).
es: No obstante, genera algunas ambigüedades si hay más de 9 grupos de captura, ya que C podría referirse al décimo grupo de captura, o al carácter cuyo ordinal en octal es 010 (un carácter de retroceso en ASCII).

source: But many people think that Unicode is special and magical, and I didn't want to disappoint them, so I decided to call the document a Unicode tutorial.
es: Pero muchas personas piensan que Unicode es algo especial y mágico. Como no quiero que se sientan defraudadas, he decidido clasificar este documento como un tutorial de Unicode.

source: But never write "PERL", because perl is not an acronym, apocryphal folklore and post-facto expansions notwithstanding.
es: Pero nunca escriba "PERL", ya que perl no es un acrónimo (pese al folclore apócrifo y los desarrollos inventados posteriormente).

source: But since you asked: by default, the internal format is either ISO-8859-1 (latin-1), or utf8, depending on the history of the string.
es: Pero para que no se quede con la duda, debe saber que, de manera predeterminada la codificación del formato interno es ISO-8859-1 (latin-1) o utf8, en función del historial de la cadena.

source: But that isn't going to match; at least, not the way you're hoping.
es: Pero eso no va a devolver una coincidencia; al menos, no de la forma esperada.

source: But the point of autovivification is that you don't have to worry about it.
es: Pero la idea de la autovivificación es no tener que preocuparnos de esto.

source: But there might not actually be any real demand for it out there.
es: pero puede ocurrir que a nadie le interese.

source: But wait, there's more...
es: Pero esto no es todo.

source: But what about the thing in the middle?
es: Pero, ¿qué pasa con el resto?

source: But within the Perl interpreter every L</referent> is treated as a member of a class derived from SV, in an object-oriented sort of way.
es: En el intérprete de Perl cada L</referente> se trata como un miembro de una clase derivada de SV de forma orientada a objetos.

source: But your program can die when you run out of virtual memory too, if you haven't thrashed your disk to death first.
es: Pero el programa también puede finalizar cuando se agota la memoria virtual, si no se ha liquidado el disco antes.

source: But, Unicode properties can have spaces, so in C<\p{...}> there can be spaces that follow the Unicode rules, for which see L<perluniprops/Properties accessible through \p{} and \P{}>.
es: Pero las propiedades Unicode sí pueden contener espacios, por lo que en C<\p{...}> puede haber espacios que cumplan las reglas de Unicode (vea L<perluniprops.pod/Propiedades accesibles a través de \p{} y \P{}>).

source: But, note that code points outside the ASCII range will use Unicode rules for C</i> matching, so the modifier doesn't really restrict things to just ASCII; it just forbids the intermixing of ASCII and non-ASCII.
es: Sin embargo, tenga en cuenta que para los códigos de caracteres que estén fuera del rango ASCII se usarán las reglas de Unicode para la detección de coincidencias con C</i>, por lo que el modificador no restringe el uso a ASCII únicamente, sino que prohíbe mezclar caracteres ASCII con caracteres que no pertenecen a ASCII.

source: But, since Perl can't keep a secret, and there may be rare instances where they are useful, they are documented here.
es: Pero se mencionan en este documento porque Perl no sabe callar un secreto y porque puede haber casos excepcionales para los que sí sean útiles.

source: But, the submitter's email address had changed since the last of their submissions, and this caused other tests to fail.
es: Pero la dirección de correo electrónico del remitente había cambiado desde su último envío, y esto hizo que se produjeran errores en otras pruebas.

source: But:
es: Sin embargo:

source: By L<dereferencing|/dereference> the first variable, you can get at the second one.
es: Al L</desreferenciar> la primera variable, obtiene la segunda.

source: By default floating point numbers substituted inside strings use the dot (".") as the decimal separator.
es: De forma predeterminada, los números de punto flotante sustituidos dentro de cadenas usan el punto (".") como separador decimal.

source: By default, Perl does a depth-first left-to-right search for a method.
es: De manera predeterminada, Perl hace una búsqueda en profundidad y con recorrido de izquierda a derecha.

source: By default, Perl does block buffering to disk files.
es: De manera predeterminada, Perl realiza el almacenamiento en búfer de bloques en archivos de disco.

source: By default, Perl's built-in OO system is very minimal, leaving you to do most of the work.
es: El sistema de orientación a objetos predeterminado de Perl es minimalista; deja al usuario la mayor parte del trabajo.

source: By default, a quantified subpattern is "greedy", that is, it will match as many times as possible (given a particular starting location) while still allowing the rest of the pattern to match.
es: De forma predeterminada, un subpatrón cuantificado es "avaricioso", es decir, busca la coincidencia más larga posible (dado un determinado punto de partida) que a la vez permita que el resto del patrón coincida.

source: By default, every method in the parent class is also available in the child.
es: De manera predeterminada, cada método de la clase primaria también estará disponible en la clase derivada.

source: By default, the "^" character is guaranteed to match only the beginning of the string, the "$" character only the end (or before the newline at the end), and Perl does certain optimizations with the assumption that the string contains only one line.
es: De manera predeterminada se garantiza que el carácter "^" detecte sólo el principio de la cadena, el carácter "$" sólo el final (o la posición anterior al carácter de nueva línea al final) y Perl hará determinadas optimizaciones suponiendo que la cadena contiene una sola línea.

source: By default, this is equivalent to C<isa>.
es: De manera predeterminada, equivale a C<isa>.

source: By default, when a quantified subpattern does not allow the rest of the overall pattern to match, Perl will backtrack.
es: De forma predeterminada, cuando un subpatrón cuantificado no permite que el resto del patrón coincida, Perl dará marcha atrás.

source: By default, whenever Perl writes to a DBM database it always writes the key and value as strings.
es: de manera predeterminada, cuando Perl escribe en una base de datos DBM, siempre escribe la clave y el valor como cadenas.

source: By first converting the FOO-encoded byte string to a text string, and then the text string to a BAR-encoded byte string:
es: Primero debe convertir la cadena de bytes con la codificación A en una cadena de texto y después la cadena de texto en una cadena de bytes con la codificación B:

source: Bytes are irrelevant here, and so are encodings.
es: En este contexto, los bytes y las codificaciones son irrelevantes.

source: C allows them.
es: C las permite.

source: C keyword introducing a structure definition or name.
es: Palabra clave de C que introduce una definición o un nombre de estructura.

source: C permits this.
es: C lo permite.

source: C<$&> returns the entire matched string.
es: C<$&> devuelve toda la cadena coincidente.

source: C<$'> returns everything after the matched string.
es: C<$'> devuelve todo lo posterior a la cadena coincidente.

source: C<$+> returns whatever the last bracket match matched.
es: C<$+> devuelve el contenido del último paréntesis de captura coincidente.

source: C<$^N> can be used in extended patterns (see below), for example to assign a submatch to a variable.
es: C<$^N> se puede usar en patrones extendidos (como se indica más abajo), por ejemplo para asignar una subcoincidencia a una variable.

source: C<$`> returns everything before the matched string.
es: C<$`> devuelve todo lo anterior a la cadena coincidente.

source: C<(?0)> is an alternate syntax for C<(?R)>.
es: C<(?0)> es una sintaxis alternativa para C<(?R)>.

source: C<(?R)> recurses to the beginning of the whole pattern.
es: C<(?R)> se ejecuta de forma recursiva hasta el comienzo del patrón completo.

source: C<(condition)> should be either an integer in parentheses (which is valid if the corresponding pair of parentheses matched), a look-ahead/look-behind/evaluate zero-width assertion, a name in angle brackets or single quotes (which is valid if a group with the given name matched), or the special symbol (R) (true when evaluated inside of recursion or eval).
es: C<(condición)> debe ser un número entero entre paréntesis (válido si se detecta el par de paréntesis correspondiente), una aserción de inspección hacia adelante/hacia atrás de ancho cero, un nombre entre corchetes angulares o comillas simples (válido si se detecta un grupo con ese nombre), o el símbolo especial (R) (verdadero cuando se evalúa dentro de una recursión o un bloque eval).

source: C<*foo = *bar> makes the typeglobs themselves synonymous while C<*foo = \$bar> makes the SCALAR portions of two distinct typeglobs refer to the same scalar value.
es: C<*foo = *bar> hace que los I<typeglobs> sean sinónimos, mientras que C<*foo = \$bar> hace que las partes escalares de dos I<typeglobs> distintos se refieran al mismo valor escalar.

source: C<++> behaves as the other operators above, except that if it is a string matching the format C</^[a-zA-Z]*[0-9]*\z/> the string increment described in L<perlop> is used.
es: C<++> se comporta como los operadores anteriores, con la diferencia de que si se aplica a una cadena que tenga el formato C</^[a-zA-Z]*[0-9]*\z/>, se usa el incremento de cadena descrito en L<perlop>.

source: C<--no-commit> means that the merge commit will be I<prepared> but not I<committed>.
es: C<--no-commit> significa que la confirmación de combinación se I<preparará>, pero no se I<confirmará>.

source: C<--no-ff> indicates that even if all your work can be applied linearly against blead, a merge commit should still be prepared.
es: C<--no-ff> indica que aunque se pueda aplicar todo el trabajo de forma lineal a blead, debe prepararse una confirmación de combinación.

source: C</a> also sets the character set to Unicode, BUT adds several restrictions for B<A>SCII-safe matching.
es: C</a> también establece el juego de caracteres en Unicode, pero agrega una serie de restricciones para la detección segura de coincidencias B<A>SCII.

source: C</ab/> means match "a" AND (then) match "b", although the attempted matches are made at different positions because "a" is not a zero-width assertion, but a one-width assertion.
es: C</ab/> significa buscar una coincidencia con "a" Y (a continuación) buscar una coincidencia con "b", aunque los intentos de coincidencia se realicen en posiciones distintas, ya que "a" no es una aserción de ancho cero, sino una aserción de ancho uno.

source: C</d> is the old, problematic, pre-5.14 B<D>efault character set behavior.
es: C</d> usa el comportamiento preB<d>eterminado de juego caracteres de las versiones anteriores a la 5.14, que era problemático.

source: C</d>, C</u>, C</a>, and C</l>, available starting in 5.14, are called the character set modifiers; they affect the character set semantics used for the regular expression.
es: C</d>, C</u>, C</a> y C</l>, disponibles a partir de la versión 5.14, se denominan modificadores de juego de caracteres; afectan a la semántica del juego de caracteres usado en la expresión regular.

source: C</u> sets the character set to B<U>nicode.
es: C</u> establece el juego de caracteres en B<U>nicode.

source: C</x> tells the regular expression parser to ignore most whitespace that is neither backslashed nor within a character class.
es: C</x> indica al analizador de expresiones regulares que ignore el espacio en blanco que no esté marcado con barras diagonales inversas de escape o que no esté dentro de una clase de caracteres.

source: C<1,,3> is C<(1,),(3)> is C<1,3> (And similarly for C<1,,,3> is C<(1,),(,),3> is C<1,3> and so on.)
es: C<1,,3> es C<(1,),(3)> y C<1,3> (y, de manera similar, C<1,,,3> es C<(1,),(,),3> y C<1,3>, y así sucesivamente).

source: C<< (?>pattern) >> does not disable backtracking altogether once it has matched.
es: C<< (?>patrón) >> no deshabilita la vuelta atrás una vez que ha coincidido.

source: C<< => >> doesn't quote compound identifiers, that contain double colons.
es: C<< => >> no entrecomilla identificadores compuestos que contengan signos de dos puntos dobles.

source: C<@EXPORT_OK>, on the other hand, specifies which symbols you're willing to export.
es: Por otra parte, C<@EXPORT_OK> le permite especificar los símbolos que desea exportar.

source: C<@INC> is also printed as part of the output of
es: C<@INC> también se imprime en pantalla como parte de la salida de

source: C<AUTOLOAD> is called as a regular method, and the caller will not know the difference.
es: Se llama a C<AUTOLOAD> igual que a un método normal, y desde la perspectiva del código que llama no hay ninguna diferencia.

source: C<BEGIN> and C<UNITCHECK> blocks are not directly related to the phase of the interpreter.
es: Los bloques C<BEGIN> y C<UNITCHECK> no están directamente relacionados con la fase del intérprete.

source: C<CHECK> code blocks are run just after the B<initial> Perl compile phase ends and before the run time begins, in LIFO order.
es: Los bloques de código C<CHECK> se ejecutan inmediatamente después de que finalice la fase B<inicial> de compilación de Perl y antes de que comience el tiempo de ejecución, en orden LIFO.

source: C<CHECK> code blocks are used in the Perl compiler suite to save the compiled state of the program.
es: Los bloques de código C<CHECK> se usan en el compilador de Perl para guardar el estado compilado del programa.

source: C<CLONE> will be called once as a class method for every package that has it defined (or inherits it).
es: Se llamará a C<CLONE> como método de clase una vez por cada paquete en el que esté definido (o que lo herede).

source: C<Class::Accessor> does a lot less than C<Moose>, and is a nice alternative if you find C<Moose> overwhelming.
es: C<Class::Accessor> es un sistema mucho más reducido que C<Moose>, pero ofrece una alternativa interesante cuando C<Moose> resulta excesivo.

source: C<END> blocks are not executed when you run perl with the C<-c> switch, or if compilation fails.
es: Los bloques C<END> no se ejecutarán si se inicia perl con el modificador C<-c> o si se produce un error de compilación.

source: C<FE<lt>E<gt>> should be the only Pod code for file names, but as most Pod formatters render it as italic, Unix and Windows paths with their slashes and backslashes may be less readable, and better rendered with C<CE<lt>E<gt>>.
es: C<FE<lt>E<gt>> debería ser el único código Pod usado para nombres de archivo, pero como la mayoría de los formateadores de Pod lo muestran en cursiva, las rutas de acceso de Unix y Windows, con sus barras diagonales y barras diagonales inversas, podrían resultar menos legibles, por lo que es mejor usar C<CE<lt>E<gt>>.

source: C<File> is a B<superclass> of C, and C is a B<subclass> of C<File>.
es: C<Archivo> es una B<superclase> de C y C es una B<subclase> de C<Archivo>.

source: C<Getopt::Long> upgraded to version 2.35
es: Se actualizó C<Getopt::Long> a la versión 2.35

source: C<INIT> blocks are run just before the Perl runtime begins execution, in "first in, first out" (FIFO) order.
es: Los bloques C<INIT> se ejecutan justo antes de iniciar el tiempo de ejecución de Perl, en orden "primero en entrar, primero en salir " (FIFO, I<first in, first out>).

source: C<INNER> refers to a totally separate global package.
es: C<INTERIOR> es un paquete global totalmente independiente.

source: C<Moose> builds on top of them and creates a full introspection layer for your classes.
es: C<Moose> se basa en ellas y crea una capa completa de introspección para sus clases.

source: C<Moose> also has several dependencies on other modules.
es: Por otra parte, C<Moose> depende de muchos módulos.

source: C<Moose> can make your code slower to load.
es: Puede hacer que su código tarde más tiempo en cargar.

source: C<Moose> describes itself using its own introspection API.
es: C<Moose> se describe a sí mismo mediante su propia API de introspección.

source: C<Moose> is a very powerful tool, and we can't cover all of its features here.
es: C<Moose> es una herramienta muy poderosa. Aquí solo hemos descrito una pequeña parte de sus características.

source: C<Moose> is the maximal option.
es: C<Moose> es la opción máxima (la más completa).

source: C<Moose> itself is not small, and it does a I<lot> of code generation when you define your class.
es: C<Moose> no es pequeño y genera una I<gran> cantidad de código cuando el usuario define sus propias clases.

source: C<Moose> itself, and some of its dependencies, require a compiler.
es: C<Moose> y algunas de sus dependencias requieren un compilador.

source: C<Moose> lets you define roles the same way you define classes:
es: C<Moose> permite definir roles de la misma forma en que se definen las clases:

source: C<Moose> provides a complete, modern OO system.
es: C<Moose> proporciona un completo y moderno sistema de orientación a objetos.

source: C<Moose> provides a layer of declarative "sugar" for defining classes.
es: C<Moose> proporciona una capa de simplificación declarativa para definir las clases.

source: C<Moose> provides a number of features:
es: C<Moose> proporciona diversas características:

source: C<Moose> was created by Stevan Little, and draws heavily from his work on the Perl 6 OO design.
es: C<Moose> fue creado por Stevan Little y se basa en su trabajo sobre el diseño de orientación a objetos de Perl 6.

source: C<Mouse> does not implement most of C<Moose>'s introspection API, so it's often faster when loading your modules.
es: C<Mouse> no implementa la mayor parte de la interfaz de introspección de C<Moose>, por lo que la carga de módulos resulta más rápida.

source: C<Mouse> implements a subset of C<Moose>'s functionality in a simpler package.
es: C<Mouse> implementa un subconjunto de la funcionalidad de C<Moose> en un paquete más simple.

source: C<Mouse> is C<Moose> lite, and a reasonable alternative when Moose doesn't work for your application.
es: C<Mouse> es una versión reducida de C<Moose> que ofrece una alternativa razonable cuando Moose no es adecuado para su aplicación.
